In [11]:
# MERGE
import pandas as pd
df1 = pd.DataFrame({
    'city': ['new york','chicago','orlando', 'baltimore'],
    'temperature': [21,14,35,22],
})
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           22

In [13]:
df2 = pd.DataFrame({
    'city': ['chicago','new york','san fransisco'],
    'humidity': [65,68,75],
})
df2

            city  humidity
0        chicago        65
1       new york        68
2  san fransisco        75

In [15]:
df = pd.merge(df1,df2, on='city') # left table, right table, on the basis of  city
df
# this only shows common values, it is a INNER JOIN in SQL

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [19]:
df = pd.merge(df1,df2, on='city', how='outer', indicator=True) # left table, right table, on the basis of
df
# how='outer' is OUTER JOIN in SQL also
# how='left' is LEFT JOIN in SQL
# how='right' is RIGHT JOIN in SQL

#indicator show which table the data came from

            city  temperature  humidity      _merge
0       new york         21.0      68.0        both
1        chicago         14.0      65.0        both
2        orlando         35.0       NaN   left_only
3      baltimore         22.0       NaN   left_only
4  san fransisco          NaN      75.0  right_only

In [20]:
# SUFFIXES: if you have column name same for both tables but the data inside them vary
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35,38],
    "humidity": [65,68,71, 75]
})
df1

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           38        75

In [21]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "temperature": [21,14,35],
    "humidity": [65,68,71]
})
df2

        city  temperature  humidity
0    chicago           21        65
1   new york           14        68
2  san diego           35        71

In [28]:
df = pd.merge(df1,df2, on='city', suffixes=('_left', '_right'))
df

,city,temperature_left,humidity_left,temperature_right,humidity_right
0,new york,21,65,14,68
1,chicago,14,68,21,65